rails-blogger/app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Yippie ky-a-mofo!"], ["created_at", "2014-05-05 19:43:43.109682"], ["title", "This is AWESOME!"], ["updated_at", "2014-05-05 19:43:43.109682"]]
---
    def create
        @article = Article.new(article_params)
        @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = 1
---
    def destroy
        @article = Article.find(params[:id])
        @article.delete

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 4  [["image_content_type", "image/jpeg"], ["image_file_name", "7lc3d.jpg"], ["image_file_size", 60470], ["image_updated_at", "2014-05-08 04:34:12.100525"], ["updated_at", "2014-05-08 04:34:12.122927"]]
---
    def update
        @article = Article.find(params[:id])
        @article.update(article_params)