rails-blogger/app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 4], ["author_name", "chicken"], ["body", "crossed the road!"], ["created_at", "2014-05-05 23:04:36.040943"], ["updated_at", "2014-05-05 23:04:36.040943"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.article_id = params[:article_id]
        @comment.save